balazsgrill/modembed/res/Devices/dsPIC30/PIC24FV32KA304.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU2" edc:desc="" edc:impl="0x69e1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PUE" edc:desc="" edc:mask="0x1" edc:name="CN16PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17PUE" edc:desc="" edc:mask="0x1" edc:name="CN17PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN18PUE" edc:desc="" edc:mask="0x1" edc:name="CN18PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN19PUE" edc:desc="" edc:mask="0x1" edc:name="CN19PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN20PUE" edc:desc="" edc:mask="0x1" edc:name="CN20PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN21PUE" edc:desc="" edc:mask="0x1" edc:name="CN21PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN22PUE" edc:desc="" edc:mask="0x1" edc:name="CN22PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23PUE" edc:desc="" edc:mask="0x1" edc:name="CN23PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24PUE" edc:desc="" edc:mask="0x1" edc:name="CN24PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25PUE" edc:desc="" edc:mask="0x1" edc:name="CN25PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN26PUE" edc:desc="" edc:mask="0x1" edc:name="CN26PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN27PUE" edc:desc="" edc:mask="0x1" edc:name="CN27PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28PUE" edc:desc="" edc:mask="0x1" edc:name="CN28PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN29PUE" edc:desc="" edc:mask="0x1" edc:name="CN29PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30PUE" edc:desc="" edc:mask="0x1" edc:name="CN30PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31PUE" edc:desc="" edc:mask="0x1" edc:name="CN31PUE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="CNPU3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000" edc:name="CNPU3" edc:nzwidth="16" edc:por="-----------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PUE" edc:desc="" edc:mask="0x1" edc:name="CN32PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN33PUE" edc:desc="" edc:mask="0x1" edc:name="CN33PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN34PUE" edc:desc="" edc:mask="0x1" edc:name="CN34PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN35PUE" edc:desc="" edc:mask="0x1" edc:name="CN35PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN36PUE" edc:desc="" edc:mask="0x1" edc:name="CN36PUE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="n----------nnnn-" edc:cname="INTCON1" edc:desc="" edc:impl="0x805e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----------0000-" edc:name="INTCON1" edc:nzwidth="0x10" edc:por="0----------0000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OSCFAIL" edc:desc="" edc:mask="0x1" edc:name="OSCFAIL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKERR" edc:desc="" edc:mask="0x1" edc:name="STKERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDRERR" edc:desc="" edc:mask="0x1" edc:name="ADDRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MATHERR" edc:desc="" edc:mask="0x1" edc:name="MATHERR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="NSTDIS" edc:desc="" edc:mask="0x1" edc:name="NSTDIS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-----------nnn" edc:cname="INTCON2" edc:desc="" edc:impl="0xc007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----------000" edc:name="INTCON2" edc:nzwidth="0x10" edc:por="00-----------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="11"/>
              <edc:SFRFieldDef edc:cname="DISI" edc:desc="" edc:mask="0x1" edc:name="DISI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ALTIVT" edc:desc="" edc:mask="0x1" edc:name="ALTIVT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnnnnn-nnnn" edc:cname="IFS0" edc:desc="" edc:impl="0xbfef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000000-0000" edc:name="IFS0" edc:nzwidth="0x10" edc:por="0-000000000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPF1IF" edc:desc="" edc:mask="0x1" edc:name="SPF1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IF" edc:desc="" edc:mask="0x1" edc:name="SPI1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NVMIF" edc:desc="" edc:mask="0x1" edc:name="NVMIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-n----nnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xfa1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0----00000" edc:name="IFS1" edc:nzwidth="0x10" edc:por="00000-0----00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SI2C1IF" edc:desc="" edc:mask="0x1" edc:name="SI2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C1IF" edc:desc="" edc:mask="0x1" edc:name="MI2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMIF" edc:desc="" edc:mask="0x1" edc:name="CMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNIF" edc:desc="" edc:mask="0x1" edc:name="CNIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------n---nn" edc:cname="IFS2" edc:desc="" edc:impl="0x4006" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0---00" edc:name="IFS2" edc:nzwidth="0x10" edc:por="----------0---00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPF2IF" edc:desc="" edc:mask="0x1" edc:name="SPF2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2IF" edc:desc="" edc:mask="0x1" edc:name="SPI2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n-----------nn-" edc:cname="IFS3" edc:desc="" edc:impl="0x210e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-----------00-" edc:name="IFS3" edc:nzwidth="0x10" edc:por="-0-----------00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SI2C2IF" edc:desc="" edc:mask="0x1" edc:name="SI2C2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C2IF" edc:desc="" edc:mask="0x1" edc:name="MI2C2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTCIF" edc:desc="" edc:mask="0x1" edc:name="RTCIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n----n----nnn-" edc:cname="IFS4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0----0----000-" edc:name="IFS4" edc:nzwidth="16" edc:por="--0----0----000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1ERIF" edc:desc="" edc:mask="0x1" edc:name="U1ERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2ERIF" edc:desc="" edc:mask="0x1" edc:name="U2ERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCIF" edc:desc="" edc:mask="0x1" edc:name="CRCIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="HLVDIF" edc:desc="" edc:mask="0x1" edc:name="HLVDIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------------n" edc:cname="IFS5" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0" edc:name="IFS5" edc:nzwidth="16" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ULPWUIF" edc:desc="" edc:mask="0x1" edc:name="ULPWUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="n-nnnnnnnnn-nnnn" edc:cname="IEC0" edc:desc="" edc:impl="0xbfef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000000-0000" edc:name="IEC0" edc:nzwidth="0x10" edc:por="0-000000000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPF1IE" edc:desc="" edc:mask="0x1" edc:name="SPF1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IE" edc:desc="" edc:mask="0x1" edc:name="SPI1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD1IE" edc:desc="" edc:mask="0x1" edc:name="AD1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NVMIE" edc:desc="" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-n----nnnnn" edc:cname="IEC1" edc:desc="" edc:impl="0xfa1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0----00000" edc:name="IEC1" edc:nzwidth="0x10" edc:por="00000-0----00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SI2C1IE" edc:desc="" edc:mask="0x1" edc:name="SI2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C1IE" edc:desc="" edc:mask="0x1" edc:name="MI2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMIE" edc:desc="" edc:mask="0x1" edc:name="CMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNIE" edc:desc="" edc:mask="0x1" edc:name="CNIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIE" edc:desc="" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIE" edc:desc="" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------n---nn" edc:cname="IEC2" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0---00" edc:name="IEC2" edc:nzwidth="16" edc:por="----------0---00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPF2IE" edc:desc="" edc:mask="0x1" edc:name="SPF2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2IE" edc:desc="" edc:mask="0x1" edc:name="SPI2IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n-----------nn-" edc:cname="IEC3" edc:desc="" edc:impl="0x4006" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-----------00-" edc:name="IEC3" edc:nzwidth="0x10" edc:por="-0-----------00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SI2C2IE" edc:desc="" edc:mask="0x1" edc:name="SI2C2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C2IE" edc:desc="" edc:mask="0x1" edc:name="MI2C2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="11"/>
              <edc:SFRFieldDef edc:cname="RTCIE" edc:desc="" edc:mask="0x1" edc:name="RTCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n----n----nnn-" edc:cname="IEC4" edc:desc="" edc:impl="0x210e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0----0----000-" edc:name="IEC4" edc:nzwidth="0x10" edc:por="--0----0----000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1ERIE" edc:desc="" edc:mask="0x1" edc:name="U1ERIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2ERIE" edc:desc="" edc:mask="0x1" edc:name="U2ERIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:desc="" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="HLVDIE" edc:desc="" edc:mask="0x1" edc:name="HLVDIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CTMUIE" edc:desc="" edc:mask="0x1" edc:name="CTMUIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
